In [1]:
import numpy as  np 
import pandas as pd

In [2]:
s = pd.Series([1,3,5, np.nan, 8,9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    8.0
5    9.0
dtype: float64

In [5]:
dates = pd.date_range('20180101', periods = 6) # so here we can add the date format without (-) .

In [6]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
# We are creating the data frame 

df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2018-01-01  1.216782  0.560675  0.646550 -0.284907
2018-01-02 -0.478300 -0.511418  0.636447 -0.173380
2018-01-03 -0.709190  1.763380 -0.217693  0.197237
2018-01-04  1.097485  0.561162  0.801710  0.523290
2018-01-05  0.898997 -0.461157 -0.484274  0.030658
2018-01-06  0.746836 -0.809994 -1.340137 -0.771921

In [17]:
# now we are creating the dataframe by passing dict objects that will be converted into series-like

df2  = pd.DataFrame({'A': 1.0,
                    'B': pd.Timestamp(20180102),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
    
df2

     A                             B    C  D      E    F
0  1.0 1970-01-01 00:00:00.020180102  1.0  3   test  foo
1  1.0 1970-01-01 00:00:00.020180102  1.0  3  train  foo
2  1.0 1970-01-01 00:00:00.020180102  1.0  3   test  foo
3  1.0 1970-01-01 00:00:00.020180102  1.0  3  train  foo

In [20]:
# If we see that the resulting dataframe have different dtypes.

df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [23]:
#  Now we will see that how we can view the data:

df.head()

                   A         B         C         D
2018-01-01  1.216782  0.560675  0.646550 -0.284907
2018-01-02 -0.478300 -0.511418  0.636447 -0.173380
2018-01-03 -0.709190  1.763380 -0.217693  0.197237
2018-01-04  1.097485  0.561162  0.801710  0.523290
2018-01-05  0.898997 -0.461157 -0.484274  0.030658

In [25]:
df.tail()

                   A         B         C         D
2018-01-02 -0.478300 -0.511418  0.636447 -0.173380
2018-01-03 -0.709190  1.763380 -0.217693  0.197237
2018-01-04  1.097485  0.561162  0.801710  0.523290
2018-01-05  0.898997 -0.461157 -0.484274  0.030658
2018-01-06  0.746836 -0.809994 -1.340137 -0.771921

In [29]:
#For rows--> Use Index
# For Columns --> Use Columns

df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
# If we want to quick statistic summary of our data:

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.462102  0.183775  0.007100 -0.079837
std    0.836838  0.966068  0.841832  0.443289
min   -0.709190 -0.809994 -1.340137 -0.771921
25%   -0.172016 -0.498853 -0.417629 -0.257025
50%    0.822917  0.049759  0.209377 -0.071361
75%    1.047863  0.561040  0.644025  0.155593
max    1.216782  1.763380  0.801710  0.523290

In [36]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [37]:
# Transposing the data:- It will change the axis:- X to Y and vice versa

df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A    1.216782   -0.478300   -0.709190    1.097485    0.898997    0.746836
B    0.560675   -0.511418    1.763380    0.561162   -0.461157   -0.809994
C    0.646550    0.636447   -0.217693    0.801710   -0.484274   -1.340137
D   -0.284907   -0.173380    0.197237    0.523290    0.030658   -0.771921

In [38]:
# sorting the data by an index
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2018-01-01 -0.284907  0.646550  0.560675  1.216782
2018-01-02 -0.173380  0.636447 -0.511418 -0.478300
2018-01-03  0.197237 -0.217693  1.763380 -0.709190
2018-01-04  0.523290  0.801710  0.561162  1.097485
2018-01-05  0.030658 -0.484274 -0.461157  0.898997
2018-01-06 -0.771921 -1.340137 -0.809994  0.746836

In [39]:
df.sort_values(by = 'B')

                   A         B         C         D
2018-01-06  0.746836 -0.809994 -1.340137 -0.771921
2018-01-02 -0.478300 -0.511418  0.636447 -0.173380
2018-01-05  0.898997 -0.461157 -0.484274  0.030658
2018-01-01  1.216782  0.560675  0.646550 -0.284907
2018-01-04  1.097485  0.561162  0.801710  0.523290
2018-01-03 -0.709190  1.763380 -0.217693  0.197237

In [40]:
################### 
#### SELECTION ####
###################

#1. Selecting by single column df['A']
#2. By slicing 

#3. Selection by label 

df.loc[dates[0]]

A    1.216782
B    0.560675
C    0.646550
D   -0.284907
Name: 2018-01-01 00:00:00, dtype: float64

In [42]:
# Selecting a multi -axis by label
df.loc[:, ['A','B', 'C']]

                   A         B         C
2018-01-01  1.216782  0.560675  0.646550
2018-01-02 -0.478300 -0.511418  0.636447
2018-01-03 -0.709190  1.763380 -0.217693
2018-01-04  1.097485  0.561162  0.801710
2018-01-05  0.898997 -0.461157 -0.484274
2018-01-06  0.746836 -0.809994 -1.340137

In [44]:
# Selecting both end points and label slicing 
df.loc['20180101':'20180104', ['A','B']]

                   A         B
2018-01-01  1.216782  0.560675
2018-01-02 -0.478300 -0.511418
2018-01-03 -0.709190  1.763380
2018-01-04  1.097485  0.561162

In [45]:
# reducing the labels 
df.loc['20180101', ['A','B']]

A    1.216782
B    0.560675
Name: 2018-01-01 00:00:00, dtype: float64

In [46]:
# For getting scaler value:

df.loc[dates[0], 'A']

1.2167821589427914

In [49]:
# For getting fasrt access to a scaler:
df.at[dates[0], 'A']

1.2167821589427914

In [50]:
###### SELECTION BY POSITION :----

df.iloc[3] # Gives you a row

A    1.097485
B    0.561162
C    0.801710
D    0.523290
Name: 2018-01-04 00:00:00, dtype: float64

In [51]:
# We can do sclicing also:
df.iloc[3:5, 0:2]

                   A         B
2018-01-04  1.097485  0.561162
2018-01-05  0.898997 -0.461157

In [53]:
# BY lists of integer position locations, similar to numpy
df. iloc[[1,2,4],[0,2]]

                   A         C
2018-01-02 -0.478300  0.636447
2018-01-03 -0.709190 -0.217693
2018-01-05  0.898997 -0.484274

In [54]:
# For slicing the rows
df.iloc[1:3, :]

                  A         B         C         D
2018-01-02 -0.47830 -0.511418  0.636447 -0.173380
2018-01-03 -0.70919  1.763380 -0.217693  0.197237

In [56]:
# for slicing a column
df.iloc[:, 0:2]

                   A         B
2018-01-01  1.216782  0.560675
2018-01-02 -0.478300 -0.511418
2018-01-03 -0.709190  1.763380
2018-01-04  1.097485  0.561162
2018-01-05  0.898997 -0.461157
2018-01-06  0.746836 -0.809994

In [57]:
# for getting a fast access
df.iat[1,1]

-0.5114183722023373

In [2]:
import pandas as pd
import numpy as np
s = pd.Series(np.random.randn(5), index=['a', 'b', 'a', 'd', 'e'])

In [3]:
s

a   -0.386513
b   -0.810208
a   -0.415552
d   -0.462098
e    0.816363
dtype: float64

In [4]:
pd.Series(5., index=('a', 'b', 'c', 'd', 'e'))

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [5]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [6]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64, 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [9]:
daf = pd.DataFrame(d)

In [10]:
daf

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [11]:
# From  dict of ndarray/lists
d = {'one': [1., 2., 3., 4.],
     'two': [4., 3., 2., 1.]}

df = pd.DataFrame(d)

In [12]:
df

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [15]:
pd.DataFrame(d, index= ['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [17]:
#  From Structured and Record Array
data = np.zeros((2, ), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])
data[:] = [(1, 2., 'Hello'), (2, 3., "World")]

In [18]:
df = pd.DataFrame(data)

In [19]:
df

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [2]:

import pandas as pd
s = pd.Series(list('abca'))

In [3]:
s

0    a
1    b
2    c
3    a
dtype: object

In [4]:
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [7]:
data = {'score': [1,3,1,5]}

In [8]:
df = pd.DataFrame(data)

# View dataframe
df

   score
0      1
1      3
2      1
3      5

In [10]:
df.rolling(window=4).mean()

   score
0    NaN
1    NaN
2    NaN
3    2.5